<%@ Page Title="ИС-2" Language="C#" MasterPageFile="~/Site.Master" AutoEventWireup="true" CodeBehind="AboutIS2.aspx.cs" Inherits="modue_integration.AboutIS2" %>

<asp:Content ID="BodyContent" ContentPlaceHolderID="MainContent" runat="server">

    <div class="jumbotron">
        <h1><img src="Files/logoIS2.png" width="60" height="60" align="middle" /> Интегрированная среда 2</h1>
        <p class="lead">На кафедре «Информационных технологий и вычислительных систем» было разработано два новых программных комплекса, получивших общее название «Интегрированная Среда 2» (ИС-2). ИС-2 включает в себя поддержку процесса начального моделирования (ИС-2 Начальная модель) и процесса концептуального моделирования (ИС-2 Концептуальная модель). На данный момент ведется разработка третьего комплекса ИС-2 – «Инфологическое моделирование».</p>
        <p><a href="http://itvs-stankin.ru/is2.html" class="btn btn-primary btn-lg">Перейти на сайт разработчика &raquo;</a></p>
    </div>

    <div style="color: rgb(0, 0, 0); font-family: yandex-sans; font-size: 15px; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; background-color: rgb(255, 255, 255); text-decoration-style: initial; text-decoration-color: initial;">
        В 2003 году на кафедре «Когнитивных технологий проектирования» МГТУ «СТАНКИН» была разработана экспериментальная версия поддержки процесса концептуального моделирования «Concept», а в 2005 году была разработана экспериментальная версия поддержки процесса инфологического моделирования «Infology». 
    <br />
        Оба этих программных комплекса применялись в научно-исследовательском и учебном процессах кафедры и были основаны на средствах, предоставляемых средой MS Access. 
    <br />   
        Призванные максимально возможно избавить пользователя от выполнения операций по заполнению спецификаций, системы «Concept» и «Infology» на основе вручную сформированных диаграмм автоматизировано заполняли спецификации и строили по ним контрольные диаграммы. 
    <br />
        Но с развитием теоретического аппарата методологии автоматизации интеллектуального труда, средств изначально выбранной среды оказалось недостаточно для полноценной программной реализации процесса моделирования, в связи с чем было принято решение о разработке новой, более полной и удобной в плане использования визуальной интегрированной среды поддержки МАИТ.
    <br />
        Вследствие этого на кафедре «Информационных технологий и вычислительных систем» было разработано два новых программных комплекса, получивших общее название «Интегрированная Среда 2» (ИС-2). ИС-2 включает в себя поддержку процесса начального моделирования (ИС-2 Начальная модель) и процесса концептуального моделирования (ИС-2 Концептуальная модель).
    <br />
        Оба этих комплекса были реализованы с учетом особенностей МАИТ и использовали средства, предоставляемые языком программирования С++, расширенным кроссплатформенным фреймворком Qt, что позволило значительно увеличить функциональность визуальной интегрированной среды и упростить ее применение.
    <br />
        Все вводимые пользователем-когнитологом данные представляются в двух формах: структурные и матричные диаграммы представляются в графическом виде для удобства восприятия и понимания; спецификации представляются в табличном виде для повышения скорости обработки информации, содержащейся в них, а также для ее более компактного хранения.
    <br />
        Программные комплексы ИС-2 имеют ряд общих базовых функций, таких как: создание именованных проектов с указанием авторства; сохранение и загрузка ранее созданных проектов с использованием специально разработанного формата файлов «*.IS2»; возможность обратной связи с разработчиками при обнаружении ошибок для их скорейшего исправления; проверка и контроль версий программы для ее своевременного обновления. 
    <br />
        Функциональные возможности каждого комплекса в отдельности соответствуют требованиям, предъявляемым МАИТ к каждой конкретной описываемой модели. Так, для ИС-2 «Начальное моделирование» выделены только те функции, которые включают в себя необходимые спецификации и диаграммы для построения начальной модели, а для ИС-2 «Концептуальное моделирование» - только те спецификации и диаграммы, которые необходимы для построения концептуальной модели соответственно.
    <br />
        На данный момент ведется разработка третьего комплекса ИС-2 – «Инфологическое моделирование».
    <br />
</div>
    <p>&nbsp;</p>
</asp:Content>
